---
kind: method
id: M:Autodesk.Revit.DB.DimensionType.GetUnitsFormatOptions
source: html/ca121374-9437-d76c-06e8-7a98d16829fd.htm
---
# Autodesk.Revit.DB.DimensionType.GetUnitsFormatOptions Method

Gets the FormatOptions to optionally override the default settings in the Units class for the units value.

## Syntax (C#)
```csharp
public FormatOptions GetUnitsFormatOptions()
```

## Returns
A copy of the FormatOptions.